{
    "version": "https://jsonfeed.org/version/1",
    "title": "TAVIDoctor.com",
    "description": "",
    "home_page_url": "https://tavidoctor.com",
    "feed_url": "https://tavidoctor.com/feed.json",
    "user_comment": "",
    "icon": "https://tavidoctor.com/media/website/original_cropped.png",
    "author": {
        "name": "Dr. Joy Shome"
    },
    "items": [
        {
            "id": "https://tavidoctor.com/back-from-the-brink/",
            "url": "https://tavidoctor.com/back-from-the-brink/",
            "title": "Back from the brink",
            "summary": "High-risk TAVI brings octogenarian lady back from the brink At 82, most would slow down and take life easy, but,&hellip;",
            "content_html": "<h2><strong>High-risk TAVI brings octogenarian lady back from the brink</strong></h2>\n<p class=\"dropcap\">At 82, most would slow down and take life easy, but, for a soft-spoken grandmother from Bengal, life had other plans. Once independent and active, she suddenly found herself unable to walk even a few steps without gasping for breath. The pain in her chest had grown unbearable, now happening also whilst just lying in bed. This prompted her family to rush her to BM Birla Heart Hospital in Kolkata.</p>\n<p>What followed was a remarkable medical journey that not only saved her life — but gave her hope to witness a long-cherished dream: seeing her granddaughter become a doctor.</p>\n<h3>Diagnosis</h3>\n<p class=\"dropcap\">Her case was handled by <strong>Dr. Joy Shome</strong>, an experienced cardiologist, who discovered she was suffering from two serious heart conditions:</p>\n<ol>\n<li>A very severely narrowed aortic valve</li>\n<li>And a critical, dangerously calcified, blockage in the left main coronary artery</li>\n</ol>\n<p>Given her age and fragility, conventional, open heart surgery treatment in the form of surgical aortic valve replacement (SAVR) and concomitant coronary artery bypass graft surgery (CABG) weren't an option. Even Transcatheter Aortic Valve Implantation (TAVI), typically a safer alternative, was high-risk in her case.</p>\n<p>Yet, her determination, and her family's unwavering faith, inspired the team to act.</p>\n<h3>Procedures</h3>\n<p class=\"dropcap\">First, the team performed a balloon valvuloplasty on an urgent basis, temporarily opening the aortic valve with a balloon to stabilize her condition.</p>\n<p>Next, they carried out rotational atherectomy to her left main coronary artery. This is a technically challenging procedure involving drilling through calcium deposits, followed by stenting to restore blood flow through her main heart artery.</p>\n<p>Finally, once she had regained enough strength, the team successfully replaced her diseased and severely narrowed aortic valve by performing the TAVI procedure through a small hole in the groin. All of these procedures were done with local anesthesia with her being awake throughout.</p>\n<h3>Prognosis</h3>\n<p class=\"dropcap\">Given her feisty nature, she was up and about on the hospital ward just hours after the procedure and home within 36 hours! Within days, she was back to her smiling, mobile, and hopeful ways again. Her mental toughness and determination shone through it all.</p>\n<p>“She had once dreamed of becoming a doctor herself but couldn't because of life circumstances,” said Dr. Shome. “Her eyes lit up when she talked about her granddaughter working hard to achieve that dream. For us, it may have been one more TAVI procedure — but for her and her family, it was their whole world restored.”</p>\n<p>Today, the octogenarian is back to doing most of her daily activities. More importantly, she’s alive and well, and looking forward to the day her granddaughter puts on a white coat. Hopefully, her new best friend, a TAVI aortic heart valve, will help her realize this goal. Her story is a powerful reminder: sometimes, the greatest victories in medicine are not just in saving a life, but in preserving the dreams that make life worth living.</p>",
            "image": "https://tavidoctor.com/media/posts/25/fotor-ai-20250410101653.jpg",
            "author": {
                "name": "Dr. Joy Shome"
            },
            "tags": [
            ],
            "date_published": "2025-04-10T09:58:19+05:30",
            "date_modified": "2025-04-10T10:19:04+05:30"
        },
        {
            "id": "https://tavidoctor.com/lifestyle-tips-to-prevent-heart-attacks-and-strokes/",
            "url": "https://tavidoctor.com/lifestyle-tips-to-prevent-heart-attacks-and-strokes/",
            "title": "Lifestyle tips to prevent heart attacks and strokes",
            "summary": "Preface The increased number of heart disease and stroke cases has emerged as a major public health concern, which has&hellip;",
            "content_html": "<h2>Preface</h2>\n<p>The increased number of heart disease and stroke cases has emerged as a major public health concern, which has necessitated immediate lifestyle modification. With urbanization and altered dietary habits, many people are at greater risk of developing conditions such as high blood pressure, diabetes, and obesity, which can lead to cardiovascular diseases. Cardiovascular disease, which consists largely of ischaemic heart disease and stroke, is the leading cause of death globally, and the World Health Organization (WHO) estimates show that India alone contributes slightly more than a fifth of these deaths.</p>\n<p>A study estimates <strong><span style=\"text-decoration: underline;\">stroke to account for approximately 1/4th of cardiovascular deaths in India</span></strong>; approximately 0.4 million of the 1.3 million cardiovascular deaths in the 30-69-year-old group have been attributed to stroke. The statistics thus demands urgent and effective preventive measures. Embracing a heart-healthy lifestyle will significantly help in bringing down the risks of conditions related to heart health. The WHO lays down that up to 80% of all premature heart attacks and strokes can be avoided through effective public health policies and individual lifestyle changes.</p>\n<p><strong><em>While an overall healthy lifestyle can be the best shield for a healthy heart, here are a few lifestyle modifications that can significantly help prevent heart stroke or delay its onset:</em></strong></p>\n<h2><strong>Being Physically Active</strong></h2>\n<p>Daily activity lowers the risk for heart disease. Physical activity will help with weight control and can lower the possibility of having other conditions that may strain the heart - high blood pressure, high cholesterol, and type 2 diabetes among them. 30-45 min of physical activity 3 to 4 times a week is associated with cardiovascular health benefits. Simple activities like gardening, cleaning the house, climbing up the stairs, or walking the dog can also be beneficial.</p>\n<h2><strong>Stress Management</strong></h2>\n<p>Chronic stress may also cause high blood pressure and other risk factors for heart disease. Some people cope with stress in unhealthy ways. For example, they may overeat, drink, or smoke. People can boost health by finding other ways of managing stress. Healthy coping strategies include exercise, relaxation techniques, mindfulness, yoga, and meditation. Chronic stress may be associated with mental health conditions such as anxiety and depression – the same conditions that also have ties to heart disease risk factors, including high blood pressure and decreased blood flow to the heart.</p>\n<h2><strong>Heart-healthy Diet</strong></h2>\n<p>Healthy eating might be the best weapon against heart disease. The food we eat can affect other factors within our control, like cholesterol, blood pressure, blood sugar, and weight. It is recommended to take a diet that is healthy and consists mostly of vegetables, fruits, and whole-grain products. To keep one’s weight steady, one should balance daily calorific intake with physical activity that burns calories commensurately.</p>\n<h2><strong>Quality Sleep</strong></h2>\n<p>During slumber, the heart rate and blood pressure usually take a dip, thus providing the cardiovascular system a well-deserved respite from the stresses of the day. The nightly fall, in fact, is one of the cardinal needs for a healthy heart because it serves to lessen the workload on the heart. Moreover, while short on rest, an individual is more prone to develop several other ailments that lead to heart disease, such as diabetes, a high body mass index (BMI), and high blood pressure.</p>\n<h2><strong>Avoiding Tobacco Products</strong></h2>\n<p>Maybe one of the best things that work for your heart is to quit smoking or using smokeless tobacco. The risk of heart disease starts to drop as early as one day after quitting. One year after quitting smoking, the risk of heart disease is about half that of a smoker.</p>\n<h2>Termini</h2>\n<p>In a nutshell, adopting a heart-healthy lifestyle is necessary to prevent strokes and maintain overall cardiovascular health. Making informed choices regarding diet, exercise, and other aspects of lifestyle provides people with an opportunity to markedly reduce their risk of suffering a heart attack or stroke.</p>",
            "author": {
                "name": "Dr. Joy Shome"
            },
            "tags": [
            ],
            "date_published": "2025-03-05T19:36:00+05:30",
            "date_modified": "2025-04-09T07:08:51+05:30"
        },
        {
            "id": "https://tavidoctor.com/maintaining-cardiovascular-health-in-winter/",
            "url": "https://tavidoctor.com/maintaining-cardiovascular-health-in-winter/",
            "title": "Maintaining Cardiovascular Health in Winter",
            "summary": "Many might rejoice the decline in temperature, as it means a return to the comfort and snugness of the winter&hellip;",
            "content_html": "<p>Many might rejoice the decline in temperature, as it means a return to the comfort and snugness of the winter months. However, these cold months pose a serious risk for the heart health and for any individual with pre-existing heart disease, special attention must be paid to heart care. While various factors put extra strain on the cardiovascular system during winter, some studies reveal that the winter <span style=\"text-decoration: underline;\">months see almost 53 per cent more potentially serious heart conditions</span> like heart attacks and strokes than the summer months.</p>\n<h2>Constricted blood vessels</h2>\n<p>Winter poses unique challenges to heart health, with colder temperatures causing blood vessels to constrict and increasing the workload on the heart. Winter is associated with a higher incidence of cardiovascular events due to the increase in stress that a drop in ambient temperature puts on heart walls and the decrease in flow to the arteries that supply blood to the heart. Moreover, during the winter, people tend to do less physical activity, which can lead to weight gain and a consequent increase in blood pressure and cholesterol levels. Exposure to extreme cold may even result in hypothermia in which body temperature drops to dangerously low levels, thus complicating cardiovascular health even further.</p>\n<h2>Sedentary lifestyle and Dehydration</h2>\n<p>The increased workload on the heart coupled with lack of physical activities and the consumption of heavier foods put people most at risk for cardiovascular events during the cold months. Protecting the heart from heart diseases during winter months requires an active approach. Primarily during winter, people should dress warm to avoid sudden exposure to cold, which can elevate blood pressure and strain the cardiovascular system. People should also maintain a balanced diet rich in seasonal vegetables, whole grains, and heart-healthy fats while limiting processed and high-fat comfort foods.</p>\n<p>Navigating the cold months with a healthy heart require people to stay active and engage in physical activities. With the limitation on outdoor activities, simple indoor workouts such as a home workout or yoga or just walking indoors can facilitate proper blood flow and reduce the level of stress on heart. Hydration and sleep, in turn, are equally significant to the maintenance of a healthy heart. During the winter, the body tends to easily get dehydrated, blood thickens, and the chance of clots increases. So, it is always advised that people should drink enough water even if not thirsty to maintain hydration and not put much pressure on the heart.</p>\n<h2>Get regular check-ups</h2>\n<p>For those in high-risk groups — such as individuals with health conditions like diabetes, hypertension, or a history of heart disease — regular health checkups and adherence to prescribed medications are vital. Through regular consultations with the doctor, potential health issues can be diagnosed early and people can get timely advice to stay healthy throughout the cold season.</p>\n<h2>Avoid stress</h2>\n<p>Stress can be another major factor in heart problems during the winter. People should limit stress and set aside time to relax and unwind through simple daily activities like meditating, listening to music or taking a hot shower. It is also noteworthy that the winter is the time for people to stay safe from common illnesses like fever or common flu. Vaccinations like the flu and pneumococcal vaccines can help prevent winter-related infections, which can indirectly strain the heart.</p>\n<h2>Conclusion</h2>\n<p>Keeping the heart safeguarded from the cold can make winter a beautiful time of the year for every individual. Not only individuals with pre-existing heart conditions but those prioritizing heart health should also have an understanding on the impact of cold weather on the heart health. By taking certain proactive measures, individuals can significantly reduce the risk of winter-related heart complications and maintain optimal cardiovascular health.</p>",
            "author": {
                "name": "Dr. Joy Shome"
            },
            "tags": [
            ],
            "date_published": "2025-01-31T17:00:00+05:30",
            "date_modified": "2025-04-09T07:07:58+05:30"
        },
        {
            "id": "https://tavidoctor.com/meril-octacor-tavi-implants/",
            "url": "https://tavidoctor.com/meril-octacor-tavi-implants/",
            "title": "Meril Octacor TAVI implants",
            "summary": "Proud to share another milestone for Swansea Bay University Health Board Morriston Hospital - I've successfully performed our first two&hellip;",
            "content_html": "<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/20//gallery/1718152698633.jpeg\" data-size=\"1536x1536\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/20//gallery/1718152698633-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"768\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/20//gallery/1718152699666.jpeg\" data-size=\"1536x1536\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/20//gallery/1718152699666-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"768\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/20//gallery/1718152701305.jpeg\" data-size=\"2048x1536\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/20//gallery/1718152701305-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n</div></div>\n<p>Proud to share another milestone for <a class=\"DgyYRhiNYAgnOCxRZXaozXbEhNkWmmmFogVQ \" target=\"_self\" href=\"https://www.linkedin.com/company/swansea-bay-university-health-board/\" data-test-app-aware-link=\"\" tabindex=\"0\">Swansea Bay University Health Board</a> <a class=\"DgyYRhiNYAgnOCxRZXaozXbEhNkWmmmFogVQ \" target=\"_self\" href=\"https://www.linkedin.com/company/morriston-hospital/\" data-test-app-aware-link=\"\" tabindex=\"0\">Morriston Hospital</a> - I've successfully performed our first two Meril Octacor TAVI implants recently with Dr <a href=\"https://www.linkedin.com/in/ak4628/\" id=\"ember1015\" class=\"ember-view\">Ayush Khurana</a> and our fantastic Cath lab team in patients with large aortic annuli. Both had annular/ LVOT calcium mandating accurate device sizing.<br><br>1st patient - 59yo gent, inpatient, admitted with syncope and severe AS with poor LV who flatly refused surgery despite multiple reviews by cardiac surgery. Type 2 bicuspid AV with calcific and fibrotic raphes. Annulus &gt;800mm2, severe annular and LVOT calcium but both measurements in range for nominal volume 32mm Meril Octacor THV. Very difficult BAV - 4 inflations needed to crack the valve. Satisfactory deployment with single digit gradient and mild AR. We were apprehensive of annular/ LVOT injury but thankfully no issues were encountered in what was a tough case. Minimal oversizing due to precise THV prosthesis selection with respect to annular and LVOT dimensions enabled a safe implant in a hostile aortic root - certainly an area of unmet clinical need. <br><br>2nd patient - Type 1 bicuspid AV with a severe calcific raphe. LVOT calcification. Again both annulus and LVOT well in range for nominal volume 30.5mm Meril Octacor THV. Beautiful result with single digit gradient and no AR. <br><br>It’s indeed a privilege that we can offer our patients in South Wales the right TAVI valve prostheses as dictated by their anatomy. Thanks for your encouragement and support Prof <a href=\"https://www.linkedin.com/in/alex-chase-500575b4/\" id=\"ember1016\" class=\"ember-view\">Alex Chase</a> and for seeing through last minute logistics to make this happen! Grateful to <a href=\"https://www.linkedin.com/in/manikchopra2003/\" id=\"ember1017\" class=\"ember-view\">Dr Manik Chopra</a> for expert proctoring and to the team at <a class=\"DgyYRhiNYAgnOCxRZXaozXbEhNkWmmmFogVQ \" target=\"_self\" href=\"https://www.linkedin.com/company/meril/\" data-test-app-aware-link=\"\" tabindex=\"0\">Meril</a> <a href=\"https://www.linkedin.com/in/pranavpandyam/\" id=\"ember1018\" class=\"ember-view\">Pranav Pandya</a> <a href=\"https://www.linkedin.com/in/yamin-zarolia-9bb19bb1/\" id=\"ember1019\" class=\"ember-view\">Yamin Zarolia</a> <a href=\"https://www.linkedin.com/in/edward-white-53ab36a5/\" id=\"ember1020\" class=\"ember-view\">Edward White</a> for helping us in getting the cases done safely and successfully. Kudos as ever to our amazing cathlab, TAVI, and wider 🫀 teams whose hard work and dedication make these wonderful things happen. 🙏<br><br>Touched by this wonderful 🇮🇳 🏴󠁧󠁢󠁷󠁬󠁳󠁿 🇬🇧 collaboration to help our patients😊</p>",
            "image": "https://tavidoctor.com/media/posts/20/1718152701305.jpeg",
            "author": {
                "name": "Dr. Joy Shome"
            },
            "tags": [
            ],
            "date_published": "2024-06-02T00:30:00+05:30",
            "date_modified": "2025-04-09T06:33:36+05:30"
        },
        {
            "id": "https://tavidoctor.com/navitor-vision-self-expandable-intra-annular-valve/",
            "url": "https://tavidoctor.com/navitor-vision-self-expandable-intra-annular-valve/",
            "title": "Navitor Vision Self-expandable TAVI Valve",
            "summary": "Proud to share that at Swansea Bay we did our first 3 TAVI cases successfully with the new, now commercially&hellip;",
            "content_html": "<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/21/gallery/1718152698633.jpeg\" data-size=\"1284x947\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/21/gallery/1718152698633-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"566\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/21/gallery/1716357918019.jpeg\" data-size=\"1284x963\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/21/gallery/1716357918019-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/21/gallery/1716357918506.jpeg\" data-size=\"1284x1284\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/21/gallery/1716357918506-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"768\"></a></figure>\n</div></div>\n<p>Proud to share that at Swansea Bay we did our first 3 TAVI cases successfully with the new, now commercially available, NAVITOR VISION self expandable intra-annular Transcatheter Heart Valve from Abbott. Glad that we’re able to offer this new technology for the benefit of our 🫀patients in South 🏴󠁧󠁢󠁷󠁬󠁳󠁿 <br>The first patient had severe AS with crippling symptoms. Hostile anatomy with a “dagger” of calcium in the LVOT and near circumferential STJ calcium. Legs were challenging too, with RCFA relatively better, but only roughly a 10mm spot available for sheath entry between inferior epigastric artery and beginning of anterior wall calcium. <br>We used a 29mm Navitor Vision THV. The novel three Tantalum markers made positioning, correcting parallax, and deploying the valve accurately, much more easier. No AR on aortogram. Fantastic haemodynamics with no gradient and AR index of 45. No postdilatation needed (which we wanted to avoid at all cost). Excellent closure on DSA.<br>Despite ~5mm implant depth, no change in conduction and patient discharged on D1 with no AR, single digit gradient (MG 3mmHg, DVI 0.69), and narrow QRS.<br>The Navitor Vision THV incorporates a really helpful iteration to the valve, and together with the Flex Nav delivery system, we were able to achieve a great outcome for our patient in a case that was high risk from all angles.<br>Thanks to the entire 🫀 team and excited that we can offer the latest technology to help our patients.</p>\n<p>This valve is also available in India now: <a href=\"https://www.abbott.in/media-center/press-releases/abbott-introduces-navitor-vision-in-india-the-next-generation-of-heart-valve-technology-designed-to-treat-aortic-stenosis.html\" target=\"_blank\" rel=\"noopener noreferrer\">Abbott Introduces NavitorTM Vision in India</a></p>",
            "image": "https://tavidoctor.com/media/posts/21/1718152698633.jpeg",
            "author": {
                "name": "Dr. Joy Shome"
            },
            "tags": [
            ],
            "date_published": "2024-05-22T06:00:00+05:30",
            "date_modified": "2025-04-09T06:32:59+05:30"
        },
        {
            "id": "https://tavidoctor.com/no1-tavi-centre-in-2023/",
            "url": "https://tavidoctor.com/no1-tavi-centre-in-2023/",
            "title": "Busiest TAVI centre in 2023",
            "summary": "3 cheers for SWANSEA BAY 🙌 It’s official: Swansea Bay TAVI service is the number 1 TAVI implanting centre in&hellip;",
            "content_html": "<p>3 cheers for SWANSEA BAY 🙌 <br><br>It’s official: Swansea Bay TAVI service is the number 1 TAVI implanting centre in the UK 🇬🇧 per million population for 2022 - 2023 🏆<br><br>Huge congratulations to the 5 🌟 Swansea Bay TAVI and 🫀 teams. <a class=\"onRHPXypfWLuNOCinrLJfqDJJJaXLBUXSKz \" target=\"_self\" href=\"https://www.linkedin.com/company/swansea-bay-university-health-board/\" data-test-app-aware-link=\"\" tabindex=\"0\"></a> <br><br>Proud and honoured to have been the TAVI fellow that year😊</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/14//gallery/1715729381127.jpeg\" data-size=\"1284x711\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/14//gallery/1715729381127-thumbnail.jpeg\" alt=\"NICOR TAVI registry Annual Report 2023 Slide showing rate of TAVI cases per million population per Health Boards in NHS, with Swansea Bay being the highest\" width=\"768\" height=\"425\"></a>\n<figcaption>Swansea Bay has the highest per million population TAVI cases</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/14//gallery/1715729381344.jpeg\" data-size=\"1284x711\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/14//gallery/1715729381344-thumbnail.jpeg\" alt=\"NICOR TAVI registry Annual Report 2023 Slide showing increasing number of TAVI cases in NHS\" width=\"768\" height=\"425\"></a>\n<figcaption>13% YoY growth in TAVI cases in NHS</figcaption>\n</figure>\n</div></div>\n<p>Source: NICOR TAVI registry Annual report 2024</p>",
            "image": "https://tavidoctor.com/media/posts/14/Tavidoctor-colleagues-2-of-12.jpeg",
            "author": {
                "name": "Dr. Joy Shome"
            },
            "tags": [
                   "TAVI / TAVR"
            ],
            "date_published": "2024-05-14T23:29:00+05:30",
            "date_modified": "2025-04-09T06:35:03+05:30"
        },
        {
            "id": "https://tavidoctor.com/first-sapien-3-ultra-resilia-thv-at-morriston/",
            "url": "https://tavidoctor.com/first-sapien-3-ultra-resilia-thv-at-morriston/",
            "title": "1st Sapien 3 Ultra Resilia",
            "summary": "Swansea Bay are delighted to be the first NHS centre in the UK to offer the Sapien Ultra RESILIA TAVI&hellip;",
            "content_html": "<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/12/gallery/1715195183160.jpeg\" data-size=\"800x600\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/12/gallery/1715195183160-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://tavidoctor.com/media/posts/12/gallery/1715195183047.jpeg\" data-size=\"800x1067\"><img decoding=\"async\" loading=\"lazy\" src=\"https://tavidoctor.com/media/posts/12/gallery/1715195183047-thumbnail.jpeg\" alt=\"\" width=\"768\" height=\"1024\"></a></figure>\n</div></div>\n<p>Swansea Bay are delighted to be the first NHS centre in the UK to offer the Sapien Ultra RESILIA TAVI (trans-catheter aortic valve implantation) valve. The latest Edwards technology has a new skirt on the largest size to minimise valve leak and a novel treatment of the hand-sewn leaflets designed to preserve valve function over time. Swansea Bay heads the table in the UK audit of access to treatment for the life-threatening condition of aortic stenosis (NICOR) and implanted the first RESILIA in the UK last week, a fantastic addition to the aortic stenosis armoury.<br>🫀💪😎Go Swansea Bay! </p>\n<h3>First Sapien 3 Ultra Resilia THV at Swansea Bay!</h3>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"504\" height=\"399\" src=\"https://www.linkedin.com/embed/feed/update/urn:li:ugcPost:7194054907346194433\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" title=\"Embedded post\"></iframe></div>\n<p>Read more about the technology here: <a href=\"https://www.edwards.com/healthcare-professionals/products-services/transcatheter-heart/transcatheter-sapien-3-ultra-resilia\" target=\"_blank\" rel=\"noopener noreferrer\">SAPIEN 3 Ultra valve, powered by RESILIA tissue</a></p>",
            "image": "https://tavidoctor.com/media/posts/12/1715195183160.jpeg",
            "author": {
                "name": "Dr. Joy Shome"
            },
            "tags": [
                   "TAVI / TAVR"
            ],
            "date_published": "2024-05-08T20:31:00+05:30",
            "date_modified": "2025-04-09T06:34:51+05:30"
        }
    ]
}
